artillery/order/order-test-single.yml
config:
  target: "http://localhost:8080" # 대상 URL
  defaults:
    http:
      timeout: 15000  # 각 요청의 타임아웃 설정. default 10s

  phases:
    - name: Ramp up to 800
      rampTo: 800
      duration: 120
      arrivalRate: 0

    - name: Hold 800
      arrivalRate: 800
      duration: 180

    - name: Ramp down to 0
      rampTo: 0
      duration: 120
      arrivalRate: 800

  payload:
    path: "./receivers.csv"
    fields:
      - receiverName
      - receiverAddress
      - receiverEmail
  processor: "./processor.js"

scenarios:
  - name: "Place an order and Pay"
    flow:
      - function: generateProductQuantities
      - post:
          url: "/api/v1/orders"
          json:
            receiverName: "{{ receiverName }}"
            receiverAddress: "{{ receiverAddress }}"
            receiverEmail: "{{ receiverEmail }}"
            productQuantities: "{{ productQuantities }}"
          capture:
            - json: "$.orderId"
              as: "orderId"
#      - post:
#          url: "/api/v1/orders/payment"
#          json:
#            orderId: "{{ orderId }}"
#            payMethod: "TOSS_PAY"