artillery/order/order-test.yml
config:
  target: "http://localhost:8081" # 대상 URL
#  defaults:
#    http:
#      timeout: 5000  # 각 요청의 타임아웃을 5초(5000ms)로 설정. default 10s

  phases:
    - name: Ramp up to 400
      rampTo: 400
      duration: 60
      arrivalRate: 200

    - name: Hold at 400
      arrivalRate: 400
      duration: 60

    - name: Ramp to 600
      rampTo: 600
      arrivalRate: 400
      duration: 60

    - name: Ramp to 800
      rampTo: 800
      arrivalRate: 600
      duration: 60

    - name: Hold at 800
      arrivalRate: 800
      duration: 150

    - name: Ramp down to 100
      rampTo: 100
      arrivalRate: 800
      duration: 60

  payload:
    path: "./receivers.csv"
    fields:
      - receiverName
      - receiverAddress
      - receiverEmail
  processor: "./processor.js"

scenarios:
  - name: "Place an order and Pay"
    flow:
      - function: generateProductQuantities
      - post:
          url: "/api/v1/orders"
          json:
            receiverName: "{{ receiverName }}"
            receiverAddress: "{{ receiverAddress }}"
            receiverEmail: "{{ receiverEmail }}"
            productQuantities: "{{ productQuantities }}"
          capture:
            - json: "$.orderId"
              as: "orderId"
#      - post:
#          url: "/api/v1/orders/payment"
#          json:
#            orderId: "{{ orderId }}"
#            payMethod: "TOSS_PAY"